In [1]:
import pandas as pd

#### Задание 1
A. Импортируйте библиотеку Pandas и дайте ей псевдоним pd.  
B. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные:
[1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].  
C. Затем создайте датафрейм book cо столбцами author_id, book_title и price,в которых соответственно содержатся данные: 
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [2]:
authors = pd.DataFrame({'author_id':[1,2,3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']})

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
books = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                      "book_title":['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 
                                    'Гроза', 'Таланты и поклонники'],
                      "price": [450, 300, 350, 500, 450, 370, 290]
                     })

In [5]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

#### Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [6]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

#### Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [9]:
top5 = authors_price.nlargest(5, 'price').reset_index(drop=True)

In [10]:
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

#### Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price.  
В датафрейме authors_stat должны быть четыре столбца:  
author_name, min_price, max_price и mean_price, в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [11]:
min_authors_price = authors_price.groupby('author_name').agg({'price': 'min'})

In [13]:
min_authors_price = min_authors_price.reset_index()

In [15]:
min_authors_price = min_authors_price.rename(columns={'price': 'min price'})

In [16]:
min_authors_price

  author_name  min price
0  Островский        290
1    Тургенев        300
2       Чехов        450

In [18]:
max_authors_price = authors_price.groupby('author_name').agg({'price': 'max'})
max_authors_price = max_authors_price.reset_index()
max_authors_price = max_authors_price.rename(columns={'price': 'max price'})
max_authors_price

  author_name  max price
0  Островский        370
1    Тургенев        450
2       Чехов        500

In [19]:
mean_authors_price = authors_price.groupby('author_name').agg({'price': 'mean'})
mean_authors_price = mean_authors_price.reset_index()
mean_authors_price = mean_authors_price.rename(columns={'price': 'mean price'})
mean_authors_price

  author_name  mean price
0  Островский  330.000000
1    Тургенев  366.666667
2       Чехов  475.000000